
&НаКлиенте
Процедура Команда1(Команда)
	ТестовыйСценарий_31_12_2017();
КонецПроцедуры
&НаКлиенте
Процедура ТестовыйСценарий_31_12_2017()

	ТестовоеПриложение = Новый ТестируемоеПриложение(, 1539);
	ВремяОкончанияОжидания = ТекущаяДата() + 60;
	Подключен = Ложь;
	ОписаниеОшибкиСоединения = "";
	Пока Не ТекущаяДата() >= ВремяОкончанияОжидания Цикл
		Попытка
			ТестовоеПриложение.УстановитьСоединение();
			Подключен = Истина;
			Прервать;
		Исключение
			ОписаниеОшибкиСоединения = ОписаниеОшибки();
		КонецПопытки;
	КонецЦикла;
	Если Не Подключен Тогда
		ТестовоеПриложение = Неопределено;
		Сообщить("Не смогли установить соединение! " + Символы.ПС + ОписаниеОшибкиСоединения);
		Возврат;
	КонецЕсли;

	ОкноПриложенияОсновноеКнопкаКомандногоИнтерфейсаПоискCtrlShiftFНажать(ТестовоеПриложение);
	ОкноПриложенияПоискПолеСтрокаПоискаВвестиТекст(ТестовоеПриложение);
	ОкноПриложения1СПредприятиеКнопкаOKНажать(ТестовоеПриложение);
	ОкноПриложенияПоискКнопкаНайтиАктивизировать(ТестовоеПриложение);

КонецПроцедуры

&НаКлиенте
Процедура ОкноПриложенияОсновноеКнопкаКомандногоИнтерфейсаПоискCtrlShiftFНажать(ТестовоеПриложение)
	
	ОкноПриложенияОсновное = Неопределено;
	КлиентсткиеОкнаТестируемогоПриложения = ТестовоеПриложение.ПолучитьПодчиненныеОбъекты();
	Для Каждого ТестируемоеОкно Из КлиентсткиеОкнаТестируемогоПриложения Цикл
		Если ТестируемоеОкно.Основное Тогда
			ОкноПриложенияОсновное = ТестируемоеОкно;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	ОкноПриложенияОсновноеCommandInterface = ОкноПриложенияОсновное.ПолучитьКомандныйИнтерфейс();
	КнопкаКомандногоИнтерфейсаПоискCtrlShiftF = ОкноПриложенияОсновноеCommandInterface.НайтиОбъект(Тип("ТестируемаяКнопкаКомандногоИнтерфейса"), "Поиск (Ctrl+Shift+F)");
	КнопкаКомандногоИнтерфейсаПоискCtrlShiftF.Нажать();

КонецПроцедуры

&НаКлиенте
Процедура ОкноПриложенияПоискПолеСтрокаПоискаВвестиТекст(ТестовоеПриложение)

	ОкноПриложенияПоиск = ТестовоеПриложение.НайтиОбъект(Тип("ТестируемоеОкноКлиентскогоПриложения"), "Поиск", , 30);
	ОкноПриложенияПоискФормаПоиск = ОкноПриложенияПоиск.НайтиОбъект(Тип("ТестируемаяФорма"), "Поиск");
	ПолеСтрокаПоиска = ОкноПриложенияПоискФормаПоиск.НайтиОбъект(Тип("ТестируемоеПолеФормы"), "СтрокаПоиска");
	ПолеСтрокаПоиска.ВвестиТекст("Алиса");

КонецПроцедуры

&НаКлиенте
Процедура ОкноПриложения1СПредприятиеКнопкаOKНажать(ТестовоеПриложение)

	ОкноПриложения1СПредприятие = ТестовоеПриложение.НайтиОбъект(Тип("ТестируемоеОкноКлиентскогоПриложения"), "1С:Предприятие", , 30);
	ОкноПриложения1СПредприятиеФорма1СПредприятие = ОкноПриложения1СПредприятие.НайтиОбъект(Тип("ТестируемаяФорма"), "1С:Предприятие");
	КнопкаOK = ОкноПриложения1СПредприятиеФорма1СПредприятие.НайтиОбъект(Тип("ТестируемаяКнопкаФормы"), "OK");
	КнопкаOK.Нажать();

КонецПроцедуры

&НаКлиенте
Процедура ОкноПриложенияПоискКнопкаНайтиАктивизировать(ТестовоеПриложение)

	ОкноПриложенияПоиск = ТестовоеПриложение.НайтиОбъект(Тип("ТестируемоеОкноКлиентскогоПриложения"), "Поиск", , 30);
	ОкноПриложенияПоискФормаПоиск = ОкноПриложенияПоиск.НайтиОбъект(Тип("ТестируемаяФорма"), "Поиск");
	КнопкаНайти = ОкноПриложенияПоискФормаПоиск.НайтиОбъект(Тип("ТестируемаяКнопкаФормы"), "Найти");
	КнопкаНайти.Активизировать();

КонецПроцедуры



